package ru.avalon.java.dev.j10.labs.shapes;

/**
 * Абстрактное представление об эллипсе.
 * <p>
 * Э́ллипс — замкнутая кривая на плоскости, которая может
 * быть получена как пересечение плоскости и кругового
 * цилиндра или как ортогональная проекция окружности на
 
 */
public interface Ellipse {
    
    /*
     * TODO: Закончить определение интерфейса 'Ellipse'
     *
     * 1. Включите интерфейс в общую систему типов.
     *
     * 2. При необходимости, дополните структуру интерфеса.
     */

    /**
     * Возвращает длину эллипса.
     *
     * @return длина эллипса
     */
    float getLength();
    
    double getR();
}
